/*******************************************************************************
 *                      
 *                         Copyright (c) 2013 
 *******************************************************************************/
 /******************************************************************************
 *
 * 模块名   : 
 *
 * 模块介绍 : 
 *
 * 历史修改 :
 *
 *   历史修改记录位于文件尾
 *
 ******************************************************************************/
 
 #ifndef __TIME_TASK_H__
 #define __TIME_TASK_H__

/*******************************************************************************
*                              I n c l u d e s                                 *
*******************************************************************************/
#include "sys.h"
#include "stdio.h"	





/*******************************************************************************
*                            D e f i n i t i o n s                             *
*******************************************************************************/
#define SCHDLR_TASK_CYCL_MAX 10

#define SCHDLR_TASKBIT_10MS       0x00000001
#define SCHDLR_TASKBIT_20MSA      0x00000002
#define SCHDLR_TASKBIT_20MSB      0x00000004
#define SCHDLR_TASKBIT_50MS       0x00000008
#define SCHDLR_TASKBIT_100MS      0x00000010

#define TIME3_FCK   90000000

#define TIM3_CLOCK_BIT     1
#define Time3_clock_enable() (RCC->APB1ENR |= (1<<TIM3_CLOCK_BIT))
#define Time3_clock_disable() (RCC->APB1ENR &= ~(1<<TIM3_CLOCK_BIT))


#define TIMEX_CEN_ENABLE  (1<<0)
#define TIMEX_CEN_DISABLE  ~(1<<0)
#define TIMEX_DIER_TIE     (1<<6)    //使能定时器中断
#define TIMEX_DIER_UIE     (1<<0)    //更新中断使能

#define TIMEX_SR_UIF   (1<<0)

/*******************************************************************************
*                              D a t a   T y p e s                             *
*******************************************************************************/

typedef struct{
	void (* const fp_vd_task)(void);/*函数指针*/
	u32 taskbit;	/*函数执行标识*/
}ST_TASK_SCHDLR;


void time3_init(void);

/*******************************************************************************
* Modification History:
*
* |    name    |    date    |       comment
*      刘连军		2013-03-05		增加加法运算函数。
*     
*
********************************************************************************/

#endif
/* End of File: template.h */


















